{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "1024"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "3"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/512x512/Shape", "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack", "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/512x512/strided_slice", "StatefulPartitionedCall/sequential_1/512x512/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["input_1", "StatefulPartitionedCall/sequential_1/512x512/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_47", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/512x512/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_48", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/512x512/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/512x512/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_47", "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_48"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_55", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_56", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_55", "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_56"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/truediv"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Shape", "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack", "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/strided_slice", "StatefulPartitionedCall/sequential_1/1024x1024/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/truediv", "StatefulPartitionedCall/sequential_1/1024x1024/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_63", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/1024x1024/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_64", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/1024x1024/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_63", "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_64"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_71", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_72", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_71", "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_72"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/ToRGB_lod0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/truediv", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/ToRGB_lod0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/512x512/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/512x512/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_15/PartitionedCall/PartitionedCall/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_16/PartitionedCall/PartitionedCall/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/1024x1024/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_17/PartitionedCall/PartitionedCall/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/pixel_norm_layer_18/PartitionedCall/PartitionedCall/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_7", "shape": [1, 1, 16, 3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_8", "shape": [3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_47", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_48", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_55", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/512x512/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_56", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_63", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_64", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_71", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/sequential_1/1024x1024/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_72", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}