{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"latents_in:0": {"name": "latents_in:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "64"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "8192"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/tf_op_layer_Transpose/Transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/tf_op_layer_AddV2/AddV2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/64x64/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/64x64/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/64x64/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/64x64/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_9/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_9/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_10/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_10/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/128x128/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/128x128/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/128x128/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/128x128/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_11/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_11/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_12/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_12/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/256x256/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/256x256/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/256x256/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/256x256/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_13/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_13/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_14/PartitionedCall/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_14/PartitionedCall/PartitionedCall/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "latents_in", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["latents_in"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["latents_in", "StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/4x4/Dense/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer/PartitionedCall/PartitionedCall/truediv", "unknown"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/4x4/Dense/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/reshape/Shape", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_1", "StatefulPartitionedCall/sequential/reshape/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/reshape/strided_slice", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/1", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/2", "StatefulPartitionedCall/sequential/reshape/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/4x4/Dense/MatMul", "StatefulPartitionedCall/sequential/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/tf_op_layer_Transpose/Transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/reshape/Reshape", "StatefulPartitionedCall/sequential/tf_op_layer_Transpose/Transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/tf_op_layer_AddV2/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/tf_op_layer_Transpose/Transpose", "StatefulPartitionedCall/sequential/tf_op_layer_AddV2/AddV2/y"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/tf_op_layer_LeakyRelu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/tf_op_layer_AddV2/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/tf_op_layer_LeakyRelu/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/tf_op_layer_LeakyRelu/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/input/_144", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/input/_145", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/truediv"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_1/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/input/_144", "Func/StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/input/_145"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/4x4/Conv/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/truediv"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/8x8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/8x8/Shape", "StatefulPartitionedCall/sequential/8x8/strided_slice/stack", "StatefulPartitionedCall/sequential/8x8/strided_slice/stack_1", "StatefulPartitionedCall/sequential/8x8/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/8x8/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/8x8/strided_slice", "StatefulPartitionedCall/sequential/8x8/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/8x8/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_2/PartitionedCall/PartitionedCall/truediv", "StatefulPartitionedCall/sequential/8x8/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_152", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/8x8/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_153", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/8x8/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/8x8/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_152", "Func/StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_153"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/8x8/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_160", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_161", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_3/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_160", "Func/StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_161"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/8x8/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/16x16/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/16x16/Shape", "StatefulPartitionedCall/sequential/16x16/strided_slice/stack", "StatefulPartitionedCall/sequential/16x16/strided_slice/stack_1", "StatefulPartitionedCall/sequential/16x16/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/16x16/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/16x16/strided_slice", "StatefulPartitionedCall/sequential/16x16/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/16x16/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_4/PartitionedCall/PartitionedCall/truediv", "StatefulPartitionedCall/sequential/16x16/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}, "align_corners": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_168", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/16x16/resize/ResizeNearestNeighbor"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_169", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/16x16/resize/ResizeNearestNeighbor"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/16x16/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_168", "Func/StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_169"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/16x16/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_176", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_177", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_5/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_176", "Func/StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_177"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/16x16/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/truediv"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/32x32/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/32x32/Shape", "StatefulPartitionedCall/sequential/32x32/strided_slice/stack", "StatefulPartitionedCall/sequential/32x32/strided_slice/stack_1", "StatefulPartitionedCall/sequential/32x32/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/32x32/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/32x32/strided_slice", "StatefulPartitionedCall/sequential/32x32/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/32x32/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_6/PartitionedCall/PartitionedCall/truediv", "StatefulPartitionedCall/sequential/32x32/mul"], "attr": {"half_pixel_centers": {"b": true}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_184", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/32x32/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_185", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/32x32/resize/ResizeNearestNeighbor"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/32x32/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_184", "Func/StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/input/_185"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/32x32/Conv0/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_192", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_193", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_7/PartitionedCall/PartitionedCall/truediv", "Func/StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_192", "Func/StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/input/_193"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Square", "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Mean", "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/32x32/Conv1/StatefulPartitionedCall/StatefulPartitionedCall/LeakyRelu", "StatefulPartitionedCall/sequential/pixel_norm_layer_8/PartitionedCall/PartitionedCall/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 